app/controllers/resources_controller.rb

SELECT "resources".* FROM "resources"  ORDER BY :precovenda1
---
  def index
    @resources = Resource.all

INSERT INTO "resources" ("codproduto", "descricao1", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["codproduto", "34434"], ["descricao1", "sdfsdfsdf"], ["created_at", "2015-07-28 19:26:28.899465"], ["updated_at", "2015-07-28 19:26:28.899465"]]
---
  def create
    @resource = Resource.new(resource_params)

    if @resource.save

UPDATE "resources" SET "descricao1" = ?, "updated_at" = ? WHERE "resources"."id" = ?  [["descricao1", "Era uma vezsss"], ["updated_at", "2015-07-29 12:16:14.084617"], ["id", 1]]
---
  def update
    if @resource.update(resource_params)

DELETE FROM "resources" WHERE "resources"."id" = ?  [["id", 2]]
---
  def destroy
    @resource.destroy

SELECT  "resources".* FROM "resources" WHERE "resources"."id" = ? LIMIT 1  [["id", 2]]
---
    def set_resource
      @resource = Resource.find(params[:id])